In [47]:
s = """
Titanic Machine learning from disaster

Columns     DESCRIPTION:
survival	Survival	            0 = No, 1 = Yes
pclass      Ticket class	        1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex	
Age	        Age in years	
sibsp	    # of siblings / spouses aboard the Titanic	
parch	    # of parents / children aboard the Titanic	
ticket	    Ticket number	
fare	    Passenger fare	
cabin	    Cabin number	
embarked	Port of Embarkation	    C = Cherbourg, Q = Queenstown, S = Southampton

"""
print(s)

Titanic Machine learning from disaster

Columns     DESCRIPTION:
survival	Survival	            0 = No, 1 = Yes
pclass      Ticket class	        1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex
Age	        Age in years
sibsp	    # of siblings / spouses aboard the Titanic
parch	    # of parents / children aboard the Titanic
ticket	    Ticket number
fare	    Passenger fare
cabin	    Cabin number
embarked	Port of Embarkation	    C = Cherbourg, Q = Queenstown, S = Southampton

In [48]:
import os
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import warnings
import seaborn as sns
from sklearn.linear_model import LogisticRegression
warnings.filterwarnings(action = 'ignore')

In [49]:
PATH = "..\Titanic - Machine learning from disaster\\titanic"
    
FILES = os.listdir(PATH)

xTrain = pd.read_csv(PATH + "\\" + FILES[2])

xTest = pd.read_csv(PATH + "\\" + FILES[1])

xTrain.shape, xTest.shape

((891, 12), (418, 11))

In [50]:
xTrain.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
xTest.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [52]:
s = """
Useless features:
    1. passengerID  : random numbers
    2. Cabin number : lot's of NaN value
    3. Ticket number
Feature engineering :
    1. Name : extract titles Mr. Mrs. Dr. 
    2. SipSb Parch : family size
Others:
    1. Pclass : categorical
    2. Sex : categorical
    3. Fare : continuous
    4. Embarked : categorical 
    5. Age : continuous
"""

print(s)

Useless features:
    1. passengerID  : random numbers
    2. Cabin number : lot's of NaN value
    3. Ticket number
Feature engineering :
    1. Name : extract titles Mr. Mrs. Dr.
    2. SipSb Parch : family size
Others:
    1. Pclass : categorical
    2. Sex : categorical
    3. Fare : continuous
    4. Embarked : categorical
    5. Age : continuous

In [53]:
useless = ['PassengerId', 'Cabin', 'Ticket']
forFeatEx = ['Name', 'SibSp', 'Parch']
rest = ['Pclass', 'Sex', 'Fare', 'Embarked', 'Age']

In [54]:
# remove useless features
_xtrain = xTrain.drop(columns = useless)
_xtest = xTest.drop(columns = useless)
_xtest.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S
2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q
3,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S

In [55]:
# feature extration with name
def featEx_name(df):
    trainL = []
    for _strain in list(df.Name):
        _s = _strain.split(", ")[1]
        trainL.append(_s.split(" ")[0])
    df['Salutation'] = trainL
    return df
def featEx_familySize(df):
    parch = list(df.Parch)
    sibsb = list(df.SibSp)
    familySize = [parch[i] + sibsb[i] for i in range(len(parch))]
    df['FamSize'] = familySize
    return df

In [56]:
_xtrain = featEx_name(_xtrain)
_xtest = featEx_name(_xtest)
_xtest.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Salutation
0,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q,Mr.
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S,Mrs.
2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q,Mr.
3,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S,Mr.
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S,Mrs.

In [57]:
_xtrain = featEx_familySize(_xtrain)
_xtest = featEx_familySize(_xtest)

_xtrain.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Salutation,FamSize
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,Mr.,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,Mrs.,1
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,Miss.,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,Mrs.,1
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,Mr.,0

In [58]:
__xtrain = _xtrain.drop(columns = ['Name'])
__xtest = _xtest.drop(columns = ['Name'])
__xtest.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked Salutation  FamSize
0       3    male  34.5      0      0   7.8292        Q        Mr.        0
1       3  female  47.0      1      0   7.0000        S       Mrs.        1
2       2    male  62.0      0      0   9.6875        Q        Mr.        0
3       3    male  27.0      0      0   8.6625        S        Mr.        0
4       3  female  22.0      1      1  12.2875        S       Mrs.        2

In [66]:
def createDumm(df, cols):
    for c in cols:
        d = pd.get_dummies(df[c])
        df = pd.concat([df, d], axis = 1)
    return df
categorical = ['Pclass', 'Sex', 'Embarked', 'Salutation']
train = createDumm(__xtrain, cols = categorical)
test = createDumm(__xtest, cols = categorical)
_train = train.drop(columns = categorical, inplace = False)
_test = test.drop(columns = categorical, inplace = False)
_test.head()

,Age,SibSp,Parch,Fare,FamSize,1,2,3,female,male,...,S,Col.,Dona.,Dr.,Master.,Miss.,Mr.,Mrs.,Ms.,Rev.
0,34.5,0,0,7.8292,0,0,0,1,0,1,...,0,0,0,0,0,0,1,0,0,0
1,47.0,1,0,7.0000,1,0,0,1,1,0,...,1,0,0,0,0,0,0,1,0,0
2,62.0,0,0,9.6875,0,0,1,0,0,1,...,0,0,0,0,0,0,1,0,0,0
3,27.0,0,0,8.6625,0,0,0,1,0,1,...,1,0,0,0,0,0,1,0,0,0
4,22.0,1,1,12.2875,2,0,0,1,1,0,...,1,0,0,0,0,0,0,1,0,0

In [60]:
def useLR(__xtrain, __xtest):

SyntaxError: unexpected EOF while parsing (<ipython-input-60-ac87907e7ae8>, line 2)